
Функция UploadDataPost(Запрос)
	
	//Получим тело запроса
	json = Запрос.ПолучитьТелоКакСтроку();
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(json);
	
	Попытка
		ДанныеОтчета = ПрочитатьJSON(Чтение);
	Исключение
		Возврат Новый HTTPСервисОтвет(404, "Не удалось прочитать тело запроса -" + ОписаниеОшибки());	
	КонецПопытки;
	
	Чтение.Закрыть();
	
	Если ДанныеОтчета.ТипОтчета = "PL" Тогда
		РезультатЗагрузки = ЗагрузкаДанных.ЗагрузитьДанныеPL();
	КонецЕсли;	
		
	КодВозврата = ?(РезультатЗагрузки.Результат, 200, 404);
	СообщениеВозврата = РезультатЗагрузки.Сообщение;	
		
	Ответ = Новый HTTPСервисОтвет(КодВозврата, СообщениеВозврата);		
	Возврат Ответ;
	
КонецФункции
