

&НаКлиенте
Процедура ПолучитьИзИсточника(Команда)
	
	Перем База;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаЗначения",ЭтаФорма, Новый Структура("Тип","ЗагрузитьДанныеИзИсточника"));
	ПоказатьВводЗначения(ОписаниеОповещения, База, ,Тип("СправочникСсылка.Базы"));

КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(Значение, ДопПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Значение) Тогда
		
		Если ДопПараметры.Тип = "ЗагрузитьДанныеИзИсточника" Тогда
			ЗагрузитьДанныеИзИсточника(Значение);
		ИначеЕсли ДопПараметры.Тип = "Синхронизировать" Тогда
			Синхронизировать(Значение)
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеИзИсточника(База)	
	Справочники.СтатьиPL.ЗагрузитьДанныеИзИсточника(База);		
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьСИсточником(Команда)
	Перем База;	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаЗначения",ЭтаФорма, Новый Структура("Тип","Синхронизировать"));
	ПоказатьВводЗначения(ОписаниеОповещения, База, ,Тип("СправочникСсылка.Базы"));
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Синхронизировать(База)
	
	Справочники.СтатьиPL.СинхронизироватьСИсточником(База);
	
КонецПроцедуры