
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДвиженияДанныеОтчетаPL = Движения.ДанныеОтчетаPL;
	ДвиженияДанныеОтчетаPL.Записывать = Истина;
	ДвиженияДанныеОтчетаPL.Очистить();
	
	ДвиженияДанныеОтчетаPL.Загрузить(ПодготовитьТаблицуДвижений_ДанныеОтчета());

КонецПроцедуры

Функция ПодготовитьТаблицуДвижений_ДанныеОтчета()
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗагрузкаДанныхPLДанныеОтчета.Ссылка КАК Регистратор,
		|	ЗагрузкаДанныхPLДанныеОтчета.Организация,
		|	ЗагрузкаДанныхPLДанныеОтчета.Статья КАК СтатьяPL,
		|	ЗагрузкаДанныхPLДанныеОтчета.Аналитика,
		|	ЗагрузкаДанныхPLДанныеОтчета.Период,
		|	СУММА(ЗагрузкаДанныхPLДанныеОтчета.Сумма) КАК Сумма,
		|	ЗагрузкаДанныхPLДанныеОтчета.Остаток
		|ИЗ
		|	Документ.ЗагрузкаДанныхPL.ДанныеОтчета КАК ЗагрузкаДанныхPLДанныеОтчета
		|ГДЕ
		|	ЗагрузкаДанныхPLДанныеОтчета.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ЗагрузкаДанныхPLДанныеОтчета.Ссылка,
		|	ЗагрузкаДанныхPLДанныеОтчета.Организация,
		|	ЗагрузкаДанныхPLДанныеОтчета.Статья,
		|	ЗагрузкаДанныхPLДанныеОтчета.Аналитика,
		|	ЗагрузкаДанныхPLДанныеОтчета.Период,
		|	ЗагрузкаДанныхPLДанныеОтчета.Остаток";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции	