
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДаннымиПоНастройкам();
	ОбновитьОтображение();

КонецПроцедуры

&НаКлиенте
Процедура НадписьДатаЗапретаНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВводаДаты", ЭтаФорма);
	ПоказатьВводДаты(ОписаниеОповещения, ДатаЗапрета, "Введите новую дату запрета", ЧастиДаты.Дата);

КонецПроцедуры

&НаКлиенте
Процедура ИмяХостаПриИзменении(Элемент)
	ИмяХостаПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДаннымиПоНастройкам()
	
	ДатаЗапрета = Константы.ДатаЗапрета.Получить();
	ИмяХоста    = Константы.ИмяХоста.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображение()
	
	Элементы.НадписьДатаЗапрета.Заголовок = ?(ДатаЗапрета = Дата("00010101"), "Дата запрета не установлена",
					"Дата запрета: " + Формат(ДатаЗапрета, "ДФ=dd.MM.yyyy;"));
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДатуЗапрета(Дата)
	Константы.ДатаЗапрета.Установить(Дата);	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаДаты(Дата, ДопПараметры) Экспорт
	
	Если Дата <> Неопределено Тогда
		УстановитьДатуЗапрета(Дата);
		ОбновитьОтображение();
	КонецЕсли;	
	
КонецПроцедуры


&НаСервере
Процедура ИмяХостаПриИзмененииНаСервере()

	Константы.ИмяХоста.Установить(ИмяХоста);	

КонецПроцедуры


#КонецОбласти

