

&НаКлиенте
Процедура ЗаполнитьСписокОрганизаций(Команда)
	
	Если Объект.СтрокаПодключения = "" ИЛИ Объект.Пользователь = "" ИЛИ Объект.Пароль = "" Тогда
		Сообщить("Заполните параметры подключения!");
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка = ПредопределенноеЗначение("Справочник.Базы.ПустаяСсылка") Тогда
		Сообщить("Перед заполнении запишите элемент справочника");
		Возврат;
	КонецЕсли;	
				
	ЗаполнитьСписокОрганизацийНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОрганизацийНаСервере()
	
	МассивОрг = Справочники.Базы.ПолучитьСписокОрганизацийИсточника(Объект.Ссылка, Объект.Пользователь, Объект.Пароль);
	
	Для Каждого Стр Из МассивОрг Цикл
		
		СтрОрг = Объект.Организации.Добавить();
		СтрОрг.Организация = Стр;
		
	КонецЦикла;	
	
КонецПроцедуры
